wayne-love/sn_esp32/src/main.cpp
#include <Arduino.h>

#if defined(ESP8266)
  #include <ESP8266WiFi.h>
  #include <ESP8266WebServer.h>

#elif defined(ESP32)
  #include <WiFi.h>
  #include <WebServer.h>

#endif

#include <WiFiClient.h>
#include <WiFiManager.h>
#include <RemoteDebug.h>
#include <PubSubClient.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <vector>
#include <Time.h>
#include <TimeLib.h>

#include "Blinker.h"

#include "WebUI.h"

#include "SpaInterface.h"


#if defined(ESP8266)
  #define EN_PIN D0 //Note: D0 seems to latch LOW when the USB cable is connected. Change to D1 if needed.
#elif defined(ESP32)
  #define EN_PIN 0
  const int LED_BUILTIN = 2;
#endif

const int TRIGGER_PIN = EN_PIN;


#ifndef DEBUG_ENABLED
    #define DEBUG_ENABLED
    RemoteDebug Debug;
#endif

SpaInterface si;

Blinker led(LED_BUILTIN);
WiFiClient wifi;
PubSubClient mqttClient(wifi);

WebUI ui(&si);



bool saveConfig = false;
long mqttLastConnect = 0;
long wifiLastConnect = millis();
long bootTime = millis();
long statusLastPublish = millis();
bool autoDiscoveryPublished = false;

String mqttServer = "";
String mqttPort = "";
String mqttUserName = "";
String mqttPassword = "";

String mqttBase = "";
String mqttStatusTopic = "";
String mqttSet = "";
String mqttAvailability = "";
String mqttLightsTopic = "";

String spaSerialNumber = "";

// Function to convert integer to time in HH:mm format
String convertToTime(int data) {
  // Extract hours and minutes from data
  int hours = (data >> 8) & 0xFF; // High byte for hours
  int minutes = data & 0xFF;      // Low byte for minutes

  // If minutes are greater than or equal to 100, adjust hours and minutes
  if (minutes >= 100) {
    int extraHours = minutes / 100;
    minutes = minutes % 100;
    hours += extraHours;
  }

  // Buffer to hold the formatted time string
  char timeStr[6]; // hh:mm + null terminator

  // Format the time string
  sprintf(timeStr, "%02d:%02d", hours, minutes);
  debugV("data: %i, timeStr %s", data, timeStr);

  return String(timeStr);
}

// Function to convert HH:mm format string to integer
int convertToInteger(const char* timeStr) {
  int hours = 0;
  int minutes = 0;
  int data = -1;

  // Check for a null or empty string
  if (timeStr == nullptr || std::strlen(timeStr) == 0) {
      return data;
  }

  // Use sscanf to parse the string into hours and minutes
  if (sscanf(timeStr, "%d:%d", &hours, &minutes) == 2) {
    // Validate hours and minutes ranges
    if (hours >= 0 && hours < 24 && minutes >= 0 && minutes < 60) {
      data = hours * 256 + minutes;
    }
  }
  debugV("data: %i, timeStr %s", data, timeStr);

  return data;
}

void saveConfigCallback(){
  saveConfig = true;
}

// We check the button on D0 every loop, to allow people to restart the system 
void checkButton(){
  if(digitalRead(TRIGGER_PIN) == LOW) {
    debugI("Initial buttong press detected");
    delay(100); // wait and then test again to ensure that it is a held button not a press
    if(digitalRead(TRIGGER_PIN) == LOW) {
      debugI("Button press detected. Starting Portal");

      if (ui.initialised) {
        ui.server->stop();
      }
      
      WiFiManager wm;
      WiFiManagerParameter custom_mqtt_server("server", "MQTT server", mqttServer.c_str(), 40);
      WiFiManagerParameter custom_mqtt_port("port", "MQTT port", mqttPort.c_str(), 6);
      WiFiManagerParameter custom_mqtt_username("username", "MQTT Username", mqttUserName.c_str(), 20 );
      WiFiManagerParameter custom_mqtt_password("password", "MQTT Password", mqttPassword.c_str(), 40 );
      wm.addParameter(&custom_mqtt_server);
      wm.addParameter(&custom_mqtt_port);
      wm.addParameter(&custom_mqtt_username);
      wm.addParameter(&custom_mqtt_password);
      wm.setBreakAfterConfig(true);
      wm.setSaveConfigCallback(saveConfigCallback);
      

      wm.startConfigPortal();
      debugI("Exiting Portal");

      if (saveConfig) {
        mqttServer = String(custom_mqtt_server.getValue());
        mqttPort = String(custom_mqtt_port.getValue());
        mqttUserName = String(custom_mqtt_username.getValue());
        mqttPassword = String(custom_mqtt_password.getValue());

        debugI("Updating config file");
        DynamicJsonDocument json(1024);
        json["mqtt_server"] = mqttServer;
        json["mqtt_port"] = mqttPort;
        json["mqtt_password"] = mqttPassword;
        json["mqtt_username"] = mqttUserName;

        File configFile = LittleFS.open("/config.json","w");
        if (!configFile) {
          debugE("Failed to open config file for writing");
        } else {
          serializeJson(json, configFile);
          configFile.close();
          debugI("Config file updated");
        }
      }

      ESP.restart();  // restart, dirty but easier than trying to restart services one by one
    }
  }
}

/*
bool parseBool(String val){
  val.toUpperCase();
  if (val=="ON" || val=="TRUE" || val=="1") {
    return true;
  } else {
    return false;
  }
}
*/
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String t = String(topic);

  String p = "";
  for (int x = 0; x < length; x++) {
    p += char(*payload);
    payload++;
  }

  debugD("MQTT subscribe received '%s' with payload '%s'",topic,p.c_str());

  String property = t.substring(t.lastIndexOf("/")+1);

  debugI("Received update for %s to %s",property.c_str(),p.c_str());

  if (property == "temperature") {
    si.setSTMP(int(p.toFloat()*10));
  } else if (property == "heatpumpmode") {
    si.setHPMP(p);
  } else if (property == "pump1") {
    si.setRB_TP_Pump1(p=="OFF"?0:1);
  } else if (property == "pump2") {
    si.setRB_TP_Pump2(p=="OFF"?0:1);
  } else if (property == "pump3") { 
    si.setRB_TP_Pump3(p=="OFF"?0:1);
  } else if (property == "pump4") {
    si.setRB_TP_Pump4(p=="OFF"?0:1);
  } else if (property == "pump5") {
    si.setRB_TP_Pump5(p=="OFF"?0:1);
  } else if (property == "auxheat") {
    si.setHELE(p=="OFF"?0:1);
  } else if (property == "datetime") {
    tmElements_t tm;
    tm.Year=CalendarYrToTm(p.substring(0,4).toInt());
    tm.Month=p.substring(5,7).toInt();
    tm.Day=p.substring(8,10).toInt();
    tm.Hour=p.substring(11,13).toInt();
    tm.Minute=p.substring(14,16).toInt();
    tm.Second=p.substring(17).toInt();
    si.setSpaTime(makeTime(tm));
  } else if (property == "lightsspeed") {
    si.setLSPDValue(p);
  } else if (property == "lights") {
    DynamicJsonDocument json(1024);
    deserializeJson(json, p);
    si.setRB_TP_Light(json["state"]=="ON"?1:0);
    if (json.containsKey("effect")) {
      const char *effect = json["effect"];
      si.setColorMode(String(effect));
    }
    if (json.containsKey("brightness")) {
      byte value = json["brightness"];
      if (value == 255) {
        value = 254;
      }
      value = (value / 51) + 1; // Map from 0 to 254 to 1 to 5
      si.setLBRTValue(value);
    }
    if (json.containsKey("color")) {
      int value = json["color"]["h"];
      si.setCurrClr(si.colorMap[value/15]);
    }
  } else if (property == "sleeptimer1state" || property == "sleeptimer2state") {
    for (int count = 0; count < sizeof(si.sleepStringMap); count++){
      if (si.sleepStringMap[count] == p)
        if (property == "sleeptimer1state")
          si.setL_1SNZ_DAY(si.sleepCodeMap[count]);
        else if (property == "sleeptimer2state")
          si.setL_2SNZ_DAY(si.sleepCodeMap[count]);
    }
  } else if (property == "sleeptimer1begin") {
    si.setL_1SNZ_BGN(convertToInteger(p.c_str()));
  } else if (property == "sleeptimer1end") {
    si.setL_1SNZ_END(convertToInteger(p.c_str()));
  } else if (property == "sleeptimer2begin") {
    si.setL_2SNZ_BGN(convertToInteger(p.c_str()));
  } else if (property == "sleeptimer2end") {
    si.setL_2SNZ_END(convertToInteger(p.c_str()));
  } else {
    debugE("Unhandled property - %s",property.c_str());
  }


